
let main = $("#main");

const items = {
	'가로등': [
		['가로등(10)', '가로등033', '경기 구리시 수택동 490-1', 37.5982944444444, 127.1430500000000, []],
		['가로등(10)', '가로등037', '경기 구리시 수택동 490-1', 37.5980000000000, 127.1432944444440, []],
		['가로등(10)', '가로등133', '경기 구리시 수택동 490-1', 37.5991472222222, 127.1424777777780, []],
		['가로등(10)', '가로등134', '경기 구리시 수택동 490-1', 37.5997583333333, 127.1421750000000, []],
		['가로등(10)', '가로등135', '경기 구리시 수택동 490-1', 37.6000972222222, 127.1419833333330, []],
		['가로등(10)', '가로등136', '경기 구리시 수택동 490-1', 37.6003027777778, 127.1416027777780, []],
		['가로등(10)', '가로등236', '경기 구리시 수택동 360', 37.6010027777778, 127.1415722222220, []],
		['가로등(10)', '가로등240', '경기 구리시 수택동 360', 37.6012083333333, 127.1419444444440, []],
		['가로등(10)', '가로등246', '경기 구리시 수택동 360', 37.6015277777778, 127.1425638888890, []],
		['가로등(10)', '가로등x01', '경기 구리시 수택동 490-1', 37.5989388888889, 127.1426777777780, []],
	],
	'고보조명': [
		['', '고보조명x01', '', 0.0, 0.0, []],
		['', '고보조명x02', '', 0.0, 0.0, []],
		['', '고보조명x03', '', 0.0, 0.0, []],
		['', '고보조명x04', '', 0.0, 0.0, []],
	],
	'공원등': [
		['', '돌다리1', '', 0.0, 0.0, []],
		['', '돌다리2', '', 0.0, 0.0, []],
		['', '돌다리3', '', 0.0, 0.0, []],
		['', '돌다리4', '', 0.0, 0.0, []],
		['', '여울목1', '', 0.0, 0.0, []],
		['', '여울목2', '', 0.0, 0.0, []],
		['', '여울목3', '', 0.0, 0.0, []],
		['', '여울목4', '', 0.0, 0.0, []],
		['', '여울목5', '', 0.0, 0.0, []],
		['', '여울목6', '', 0.0, 0.0, []],
		['', '여울목7', '', 0.0, 0.0, []],
		['', '여울목8', '', 0.0, 0.0, []],
		['', '여울목9', '', 0.0, 0.0, []],
	],
	'반사경': [
		['', '반사경x01', '', 0.0, 0.0, []],
		['', '반사경x02', '', 0.0, 0.0, []],
		['', '반사경x03', '', 0.0, 0.0, []],
		['', '반사경x04', '', 0.0, 0.0, []],
		['', '반사경x05', '', 0.0, 0.0, []],
		['', '반사경x06', '', 0.0, 0.0, []],
		['', '반사경x07', '', 0.0, 0.0, []],
		['', '반사경x08', '', 0.0, 0.0, []],
		['', '반사경x09', '', 0.0, 0.0, []],
		['', '반사경x10', '', 0.0, 0.0, []],
		['', '반사경x11', '', 0.0, 0.0, []],
		['', '반사경x12', '', 0.0, 0.0, []],
		['', '반사경x13', '', 0.0, 0.0, []],
	],
};

const item = items.가로등;

for (let i = 0; i < item.length; i++) {
	const element = item[i];

	let article = `
	<div class="w3-contqainer w3-green">
		<h1>시설물 관리대장 > ` + element[0] + `</h1> 
		<p class="txt-right">` + i + ` / `+ item.length + `</p> 
	</div>
	<div class="w3-row-padding">
		<div class="w3-half">
			<hr />
			<h3>` + element[1] + `</h3>
			<p>- 주소 : ` + element[2] + `</p>
			<p>- 위도 : ` + element[3] + `</p>
			<p>- 경도 : ` + element[4] + `</p>
			<hr />
			<h3>비고</h3>
			<p>` + (element[5][0] == undefined ? "" : "- " + element[5][0]) + `</p>
			<p>` + (element[5][1] == undefined ? "" : "- " + element[5][1]) + `</p>
			<p>` + (element[5][2] == undefined ? "" : "- " + element[5][2]) + `</p>
			<p>` + (element[5][3] == undefined ? "" : "- " + element[5][3]) + `</p>
			<p>` + (element[5][4] == undefined ? "" : "- " + element[5][4]) + `</p>
			<p>` + (element[5][5] == undefined ? "" : "- " + element[5][5]) + `</p>
			<p>` + (element[5][6] == undefined ? "" : "- " + element[5][6]) + `</p>
			<p>` + (element[5][7] == undefined ? "" : "- " + element[5][7]) + `</p>
			<p>` + (element[5][8] == undefined ? "" : "- " + element[5][8]) + `</p>
			<p>` + (element[5][9] == undefined ? "" : "- " + element[5][9]) + `</p>
		</div>
		<div class="w3-half">
			<img src="./images/` + element[0] + `/` + element[1] + `.jpeg" class="sisul" />
		</div>
	</div>

	<div class="page"></div>
	`;

	main.append(article);
}

